yangchengxcy/da14580/src/dialog/include/reg_blecore.h
// field definitions
#define BLE_CSFORMAT_ERROR_BIT         ((uint32_t)0x00000800)
#define BLE_CSFORMAT_ERROR_POS         11
#define BLE_CSTXPTR_ERROR_BIT          ((uint32_t)0x00000400)
#define BLE_CSTXPTR_ERROR_POS          10
#define BLE_RADIO_EMACC_ERROR_BIT      ((uint32_t)0x00000100)
#define BLE_RADIO_EMACC_ERROR_POS      8
#define BLE_LLCHMAP_ERROR_BIT          ((uint32_t)0x00000080)
#define BLE_LLCHMAP_ERROR_POS          7
#define BLE_IFS_UNDERRUN_BIT           ((uint32_t)0x00000040)
#define BLE_IFS_UNDERRUN_POS           6
#define BLE_RXCRYPT_ERROR_BIT          ((uint32_t)0x00000020)
#define BLE_RXCRYPT_ERROR_POS          5
#define BLE_WHITELIST_ERROR_BIT        ((uint32_t)0x00000010)
#define BLE_WHITELIST_ERROR_POS        4
#define BLE_APFM_ERROR_BIT             ((uint32_t)0x00000008)
#define BLE_APFM_ERROR_POS             3
#define BLE_TXDESC_ERROR_BIT           ((uint32_t)0x00000004)
#define BLE_TXDESC_ERROR_POS           2
#define BLE_PKTCNTL_EMACC_ERROR_BIT    ((uint32_t)0x00000002)
#define BLE_PKTCNTL_EMACC_ERROR_POS    1
#define BLE_TXCRYPT_ERROR_BIT          ((uint32_t)0x00000001)
#define BLE_TXCRYPT_ERROR_POS          0

#define BLE_CSFORMAT_ERROR_RST         0x0
#define BLE_CSTXPTR_ERROR_RST          0x0
#define BLE_RADIO_EMACC_ERROR_RST      0x0
#define BLE_LLCHMAP_ERROR_RST          0x0
#define BLE_IFS_UNDERRUN_RST           0x0
#define BLE_RXCRYPT_ERROR_RST          0x0
#define BLE_WHITELIST_ERROR_RST        0x0
#define BLE_APFM_ERROR_RST             0x0
#define BLE_TXDESC_ERROR_RST           0x0
#define BLE_PKTCNTL_EMACC_ERROR_RST    0x0
#define BLE_TXCRYPT_ERROR_RST          0x0

__INLINE void ble_errortypestat_unpack(uint8_t* csformaterror, uint8_t* cstxptrerror, uint8_t* radioemaccerror, uint8_t* llchmaperror, uint8_t* ifsunderrun, uint8_t* rxcrypterror, uint8_t* whitelisterror, uint8_t* apfmerror, uint8_t* txdescerror, uint8_t* pktcntlemaccerror, uint8_t* txcrypterror)
{
    uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);

    *csformaterror = (localVal & ((uint32_t)0x00000800)) >> 11;
    *cstxptrerror = (localVal & ((uint32_t)0x00000400)) >> 10;
    *radioemaccerror = (localVal & ((uint32_t)0x00000100)) >> 8;
    *llchmaperror = (localVal & ((uint32_t)0x00000080)) >> 7;
    *ifsunderrun = (localVal & ((uint32_t)0x00000040)) >> 6;
    *rxcrypterror = (localVal & ((uint32_t)0x00000020)) >> 5;
    *whitelisterror = (localVal & ((uint32_t)0x00000010)) >> 4;
    *apfmerror = (localVal & ((uint32_t)0x00000008)) >> 3;
    *txdescerror = (localVal & ((uint32_t)0x00000004)) >> 2;
    *pktcntlemaccerror = (localVal & ((uint32_t)0x00000002)) >> 1;
    *txcrypterror = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t ble_csformat_error_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000800)) >> 11);
}

__INLINE uint8_t ble_cstxptr_error_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000400)) >> 10);
}

__INLINE uint8_t ble_radio_emacc_error_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__INLINE uint8_t ble_llchmap_error_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__INLINE uint8_t ble_ifs_underrun_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

__INLINE uint8_t ble_rxcrypt_error_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

__INLINE uint8_t ble_whitelist_error_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE uint8_t ble_apfm_error_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE uint8_t ble_txdesc_error_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE uint8_t ble_pktcntl_emacc_error_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE uint8_t ble_txcrypt_error_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/**
 * @brief SWPROFILING register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31             SWPROF31   0
 *     30             SWPROF30   0
 *     29             SWPROF29   0
 *     28             SWPROF28   0
 *     27             SWPROF27   0
 *     26             SWPROF26   0
 *     25             SWPROF25   0
 *     24             SWPROF24   0
 *     23             SWPROF23   0
 *     22             SWPROF22   0
 *     21             SWPROF21   0
 *     20             SWPROF20   0
 *     19             SWPROF19   0
 *     18             SWPROF18   0
 *     17             SWPROF17   0
 *     16             SWPROF16   0
 *     15             SWPROF15   0
 *     14             SWPROF14   0
 *     13             SWPROF13   0
 *     12             SWPROF12   0
 *     11             SWPROF11   0
 *     10             SWPROF10   0
 *     09              SWPROF9   0
 *     08              SWPROF8   0
 *     07              SWPROF7   0
 *     06              SWPROF6   0
 *     05              SWPROF5   0
 *     04              SWPROF4   0
 *     03              SWPROF3   0
 *     02              SWPROF2   0
 *     01              SWPROF1   0
 *     00              SWPROF0   0
 * </pre>
 */
#define BLE_SWPROFILING_ADDR   0x40000064
#define BLE_SWPROFILING_OFFSET 0x00000064
#define BLE_SWPROFILING_INDEX  0x00000019
#define BLE_SWPROFILING_RESET  0x00000000

