yangchengxcy/da14580/src/dialog/include/reg_blecore.h
__INLINE void ble_swprof5_setf(uint8_t swprof5)
{
    ASSERT_ERR((((uint32_t)swprof5 << 5) & ~((uint32_t)0x00000020)) == 0);
    REG_BLE_WR(BLE_SWPROFILING_ADDR, (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00000020)) | ((uint32_t)swprof5 << 5));
}

__INLINE uint8_t ble_swprof4_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE void ble_swprof4_setf(uint8_t swprof4)
{
    ASSERT_ERR((((uint32_t)swprof4 << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_BLE_WR(BLE_SWPROFILING_ADDR, (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)swprof4 << 4));
}

__INLINE uint8_t ble_swprof3_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE void ble_swprof3_setf(uint8_t swprof3)
{
    ASSERT_ERR((((uint32_t)swprof3 << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_BLE_WR(BLE_SWPROFILING_ADDR, (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00000008)) | ((uint32_t)swprof3 << 3));
}

__INLINE uint8_t ble_swprof2_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE void ble_swprof2_setf(uint8_t swprof2)
{
    ASSERT_ERR((((uint32_t)swprof2 << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_BLE_WR(BLE_SWPROFILING_ADDR, (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00000004)) | ((uint32_t)swprof2 << 2));
}

__INLINE uint8_t ble_swprof1_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void ble_swprof1_setf(uint8_t swprof1)
{
    ASSERT_ERR((((uint32_t)swprof1 << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_BLE_WR(BLE_SWPROFILING_ADDR, (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)swprof1 << 1));
}

__INLINE uint8_t ble_swprof0_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void ble_swprof0_setf(uint8_t swprof0)
{
    ASSERT_ERR((((uint32_t)swprof0 << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_BLE_WR(BLE_SWPROFILING_ADDR, (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)swprof0 << 0));
}

/**
 * @brief RADIOCNTL0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:26               VGACNT   0x0
 *  25:24               LNACNT   0x0
 *     23        AGCFORCE_MODE   0
 *     22            DPCORR_EN   0
 *     21        SPISWACCDBGEN   0
 *     20     CORR_WIN_MSK_DSB   0
 *     19          FORCEAGC_EN   0
 *     18           FORCEBLEIQ   0
 *  13:12              RXLOWIF   0x2
 *     09             BIDIRCLK   0
 *     08            BIDIRDATA   1
 *     07               SPIPOL   0
 *  06:05              SPIFREQ   0x0
 *     04              SPIMODE   0
 *     01              SPICOMP   1
 *     00                SPIGO   0
 * </pre>
 */
#define BLE_RADIOCNTL0_ADDR   0x40000070
#define BLE_RADIOCNTL0_OFFSET 0x00000070
#define BLE_RADIOCNTL0_INDEX  0x0000001C
#define BLE_RADIOCNTL0_RESET  0x00002102

__INLINE uint32_t ble_radiocntl0_get(void)
{
    return REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
}

__INLINE void ble_radiocntl0_set(uint32_t value)
{
    REG_BLE_WR(BLE_RADIOCNTL0_ADDR, value);
}

// field definitions
#define BLE_VGACNT_MASK             ((uint32_t)0xFC000000)
#define BLE_VGACNT_LSB              26
#define BLE_VGACNT_WIDTH            ((uint32_t)0x00000006)
#define BLE_LNACNT_MASK             ((uint32_t)0x03000000)
#define BLE_LNACNT_LSB              24
#define BLE_LNACNT_WIDTH            ((uint32_t)0x00000002)
#define BLE_AGCFORCE_MODE_BIT       ((uint32_t)0x00800000)
#define BLE_AGCFORCE_MODE_POS       23
#define BLE_DPCORR_EN_BIT           ((uint32_t)0x00400000)
#define BLE_DPCORR_EN_POS           22
#define BLE_SPISWACCDBGEN_BIT       ((uint32_t)0x00200000)
#define BLE_SPISWACCDBGEN_POS       21
#define BLE_CORR_WIN_MSK_DSB_BIT    ((uint32_t)0x00100000)
#define BLE_CORR_WIN_MSK_DSB_POS    20
#define BLE_FORCEAGC_EN_BIT         ((uint32_t)0x00080000)
#define BLE_FORCEAGC_EN_POS         19
#define BLE_FORCEBLEIQ_BIT          ((uint32_t)0x00040000)
#define BLE_FORCEBLEIQ_POS          18
#define BLE_RXLOWIF_MASK            ((uint32_t)0x00003000)
#define BLE_RXLOWIF_LSB             12
#define BLE_RXLOWIF_WIDTH           ((uint32_t)0x00000002)
#define BLE_BIDIRCLK_BIT            ((uint32_t)0x00000200)
#define BLE_BIDIRCLK_POS            9
#define BLE_BIDIRDATA_BIT           ((uint32_t)0x00000100)
#define BLE_BIDIRDATA_POS           8
#define BLE_SPIPOL_BIT              ((uint32_t)0x00000080)
#define BLE_SPIPOL_POS              7
#define BLE_SPIFREQ_MASK            ((uint32_t)0x00000060)
#define BLE_SPIFREQ_LSB             5
#define BLE_SPIFREQ_WIDTH           ((uint32_t)0x00000002)
#define BLE_SPIMODE_BIT             ((uint32_t)0x00000010)
#define BLE_SPIMODE_POS             4
#define BLE_SPICOMP_BIT             ((uint32_t)0x00000002)
#define BLE_SPICOMP_POS             1
#define BLE_SPIGO_BIT               ((uint32_t)0x00000001)
#define BLE_SPIGO_POS               0

#define BLE_VGACNT_RST              0x0
#define BLE_LNACNT_RST              0x0
#define BLE_AGCFORCE_MODE_RST       0x0
#define BLE_DPCORR_EN_RST           0x0
#define BLE_SPISWACCDBGEN_RST       0x0
#define BLE_CORR_WIN_MSK_DSB_RST    0x0
#define BLE_FORCEAGC_EN_RST         0x0
#define BLE_FORCEBLEIQ_RST          0x0
#define BLE_RXLOWIF_RST             0x2
#define BLE_BIDIRCLK_RST            0x0
#define BLE_BIDIRDATA_RST           0x1
#define BLE_SPIPOL_RST              0x0
#define BLE_SPIFREQ_RST             0x0
#define BLE_SPIMODE_RST             0x0
#define BLE_SPICOMP_RST             0x1
#define BLE_SPIGO_RST               0x0

