yangchengxcy/da14580/src/dialog/include/reg_blecore.h
__INLINE void ble_radiocntl0_pack(uint8_t vgacnt, uint8_t lnacnt, uint8_t agcforcemode, uint8_t dpcorren, uint8_t spiswaccdbgen, uint8_t corrwinmskdsb, uint8_t forceagcen, uint8_t forcebleiq, uint8_t rxlowif, uint8_t bidirclk, uint8_t bidirdata, uint8_t spipol, uint8_t spifreq, uint8_t spimode, uint8_t spigo)
{
    ASSERT_ERR((((uint32_t)vgacnt << 26) & ~((uint32_t)0xFC000000)) == 0);
    ASSERT_ERR((((uint32_t)lnacnt << 24) & ~((uint32_t)0x03000000)) == 0);
    ASSERT_ERR((((uint32_t)agcforcemode << 23) & ~((uint32_t)0x00800000)) == 0);
    ASSERT_ERR((((uint32_t)dpcorren << 22) & ~((uint32_t)0x00400000)) == 0);
    ASSERT_ERR((((uint32_t)spiswaccdbgen << 21) & ~((uint32_t)0x00200000)) == 0);
    ASSERT_ERR((((uint32_t)corrwinmskdsb << 20) & ~((uint32_t)0x00100000)) == 0);
    ASSERT_ERR((((uint32_t)forceagcen << 19) & ~((uint32_t)0x00080000)) == 0);
    ASSERT_ERR((((uint32_t)forcebleiq << 18) & ~((uint32_t)0x00040000)) == 0);
    ASSERT_ERR((((uint32_t)rxlowif << 12) & ~((uint32_t)0x00003000)) == 0);
    ASSERT_ERR((((uint32_t)bidirclk << 9) & ~((uint32_t)0x00000200)) == 0);
    ASSERT_ERR((((uint32_t)bidirdata << 8) & ~((uint32_t)0x00000100)) == 0);
    ASSERT_ERR((((uint32_t)spipol << 7) & ~((uint32_t)0x00000080)) == 0);
    ASSERT_ERR((((uint32_t)spifreq << 5) & ~((uint32_t)0x00000060)) == 0);
    ASSERT_ERR((((uint32_t)spimode << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)spigo << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL0_ADDR,  ((uint32_t)vgacnt << 26) | ((uint32_t)lnacnt << 24) | ((uint32_t)agcforcemode << 23) | ((uint32_t)dpcorren << 22) | ((uint32_t)spiswaccdbgen << 21) | ((uint32_t)corrwinmskdsb << 20) | ((uint32_t)forceagcen << 19) | ((uint32_t)forcebleiq << 18) | ((uint32_t)rxlowif << 12) | ((uint32_t)bidirclk << 9) | ((uint32_t)bidirdata << 8) | ((uint32_t)spipol << 7) | ((uint32_t)spifreq << 5) | ((uint32_t)spimode << 4) | ((uint32_t)spigo << 0));
}

__INLINE void ble_radiocntl0_unpack(uint8_t* vgacnt, uint8_t* lnacnt, uint8_t* agcforcemode, uint8_t* dpcorren, uint8_t* spiswaccdbgen, uint8_t* corrwinmskdsb, uint8_t* forceagcen, uint8_t* forcebleiq, uint8_t* rxlowif, uint8_t* bidirclk, uint8_t* bidirdata, uint8_t* spipol, uint8_t* spifreq, uint8_t* spimode, uint8_t* spicomp, uint8_t* spigo)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);

    *vgacnt = (localVal & ((uint32_t)0xFC000000)) >> 26;
    *lnacnt = (localVal & ((uint32_t)0x03000000)) >> 24;
    *agcforcemode = (localVal & ((uint32_t)0x00800000)) >> 23;
    *dpcorren = (localVal & ((uint32_t)0x00400000)) >> 22;
    *spiswaccdbgen = (localVal & ((uint32_t)0x00200000)) >> 21;
    *corrwinmskdsb = (localVal & ((uint32_t)0x00100000)) >> 20;
    *forceagcen = (localVal & ((uint32_t)0x00080000)) >> 19;
    *forcebleiq = (localVal & ((uint32_t)0x00040000)) >> 18;
    *rxlowif = (localVal & ((uint32_t)0x00003000)) >> 12;
    *bidirclk = (localVal & ((uint32_t)0x00000200)) >> 9;
    *bidirdata = (localVal & ((uint32_t)0x00000100)) >> 8;
    *spipol = (localVal & ((uint32_t)0x00000080)) >> 7;
    *spifreq = (localVal & ((uint32_t)0x00000060)) >> 5;
    *spimode = (localVal & ((uint32_t)0x00000010)) >> 4;
    *spicomp = (localVal & ((uint32_t)0x00000002)) >> 1;
    *spigo = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t ble_vgacnt_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
    return ((localVal & ((uint32_t)0xFC000000)) >> 26);
}

__INLINE void ble_vgacnt_setf(uint8_t vgacnt)
{
    ASSERT_ERR((((uint32_t)vgacnt << 26) & ~((uint32_t)0xFC000000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL0_ADDR, (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0xFC000000)) | ((uint32_t)vgacnt << 26));
}

__INLINE uint8_t ble_lnacnt_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x03000000)) >> 24);
}

__INLINE void ble_lnacnt_setf(uint8_t lnacnt)
{
    ASSERT_ERR((((uint32_t)lnacnt << 24) & ~((uint32_t)0x03000000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL0_ADDR, (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x03000000)) | ((uint32_t)lnacnt << 24));
}

__INLINE uint8_t ble_agcforce_mode_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00800000)) >> 23);
}

__INLINE void ble_agcforce_mode_setf(uint8_t agcforcemode)
{
    ASSERT_ERR((((uint32_t)agcforcemode << 23) & ~((uint32_t)0x00800000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL0_ADDR, (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00800000)) | ((uint32_t)agcforcemode << 23));
}

__INLINE uint8_t ble_dpcorr_en_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00400000)) >> 22);
}

__INLINE void ble_dpcorr_en_setf(uint8_t dpcorren)
{
    ASSERT_ERR((((uint32_t)dpcorren << 22) & ~((uint32_t)0x00400000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL0_ADDR, (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00400000)) | ((uint32_t)dpcorren << 22));
}

__INLINE uint8_t ble_spiswaccdbgen_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00200000)) >> 21);
}

__INLINE void ble_spiswaccdbgen_setf(uint8_t spiswaccdbgen)
{
    ASSERT_ERR((((uint32_t)spiswaccdbgen << 21) & ~((uint32_t)0x00200000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL0_ADDR, (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00200000)) | ((uint32_t)spiswaccdbgen << 21));
}

__INLINE uint8_t ble_corr_win_msk_dsb_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00100000)) >> 20);
}

__INLINE void ble_corr_win_msk_dsb_setf(uint8_t corrwinmskdsb)
{
    ASSERT_ERR((((uint32_t)corrwinmskdsb << 20) & ~((uint32_t)0x00100000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL0_ADDR, (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00100000)) | ((uint32_t)corrwinmskdsb << 20));
}

__INLINE uint8_t ble_forceagc_en_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00080000)) >> 19);
}

__INLINE void ble_forceagc_en_setf(uint8_t forceagcen)
{
    ASSERT_ERR((((uint32_t)forceagcen << 19) & ~((uint32_t)0x00080000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL0_ADDR, (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00080000)) | ((uint32_t)forceagcen << 19));
}

__INLINE uint8_t ble_forcebleiq_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00040000)) >> 18);
}

__INLINE void ble_forcebleiq_setf(uint8_t forcebleiq)
{
    ASSERT_ERR((((uint32_t)forcebleiq << 18) & ~((uint32_t)0x00040000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL0_ADDR, (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00040000)) | ((uint32_t)forcebleiq << 18));
}

