yangchengxcy/da14580/src/dialog/include/reg_blecore.h
__INLINE uint8_t ble_rxlowif_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00003000)) >> 12);
}

__INLINE void ble_rxlowif_setf(uint8_t rxlowif)
{
    ASSERT_ERR((((uint32_t)rxlowif << 12) & ~((uint32_t)0x00003000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL0_ADDR, (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00003000)) | ((uint32_t)rxlowif << 12));
}

__INLINE uint8_t ble_bidirclk_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000200)) >> 9);
}

__INLINE void ble_bidirclk_setf(uint8_t bidirclk)
{
    ASSERT_ERR((((uint32_t)bidirclk << 9) & ~((uint32_t)0x00000200)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL0_ADDR, (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00000200)) | ((uint32_t)bidirclk << 9));
}

__INLINE uint8_t ble_bidirdata_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__INLINE void ble_bidirdata_setf(uint8_t bidirdata)
{
    ASSERT_ERR((((uint32_t)bidirdata << 8) & ~((uint32_t)0x00000100)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL0_ADDR, (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00000100)) | ((uint32_t)bidirdata << 8));
}

__INLINE uint8_t ble_spipol_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__INLINE void ble_spipol_setf(uint8_t spipol)
{
    ASSERT_ERR((((uint32_t)spipol << 7) & ~((uint32_t)0x00000080)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL0_ADDR, (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00000080)) | ((uint32_t)spipol << 7));
}

__INLINE uint8_t ble_spifreq_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000060)) >> 5);
}

__INLINE void ble_spifreq_setf(uint8_t spifreq)
{
    ASSERT_ERR((((uint32_t)spifreq << 5) & ~((uint32_t)0x00000060)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL0_ADDR, (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00000060)) | ((uint32_t)spifreq << 5));
}

__INLINE uint8_t ble_spimode_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE void ble_spimode_setf(uint8_t spimode)
{
    ASSERT_ERR((((uint32_t)spimode << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL0_ADDR, (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)spimode << 4));
}

__INLINE uint8_t ble_spicomp_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE uint8_t ble_spigo_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void ble_spigo_setf(uint8_t spigo)
{
    ASSERT_ERR((((uint32_t)spigo << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL0_ADDR, (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)spigo << 0));
}

/**
 * @brief RADIOCNTL1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     28            RAMP_TYPE   0
 *  27:24             RAMPSTEP   0x0
 *  20:16               XRFSEL   0x0
 *  15:00               SPIPTR   0x0
 * </pre>
 */
#define BLE_RADIOCNTL1_ADDR   0x40000074
#define BLE_RADIOCNTL1_OFFSET 0x00000074
#define BLE_RADIOCNTL1_INDEX  0x0000001D
#define BLE_RADIOCNTL1_RESET  0x00000000

__INLINE uint32_t ble_radiocntl1_get(void)
{
    return REG_BLE_RD(BLE_RADIOCNTL1_ADDR);
}

__INLINE void ble_radiocntl1_set(uint32_t value)
{
    REG_BLE_WR(BLE_RADIOCNTL1_ADDR, value);
}

// field definitions
#define BLE_RAMP_TYPE_BIT    ((uint32_t)0x10000000)
#define BLE_RAMP_TYPE_POS    28
#define BLE_RAMPSTEP_MASK    ((uint32_t)0x0F000000)
#define BLE_RAMPSTEP_LSB     24
#define BLE_RAMPSTEP_WIDTH   ((uint32_t)0x00000004)
#define BLE_XRFSEL_MASK      ((uint32_t)0x001F0000)
#define BLE_XRFSEL_LSB       16
#define BLE_XRFSEL_WIDTH     ((uint32_t)0x00000005)
#define BLE_SPIPTR_MASK      ((uint32_t)0x0000FFFF)
#define BLE_SPIPTR_LSB       0
#define BLE_SPIPTR_WIDTH     ((uint32_t)0x00000010)

#define BLE_RAMP_TYPE_RST    0x0
#define BLE_RAMPSTEP_RST     0x0
#define BLE_XRFSEL_RST       0x0
#define BLE_SPIPTR_RST       0x0

__INLINE void ble_radiocntl1_pack(uint8_t ramptype, uint8_t rampstep, uint8_t xrfsel, uint16_t spiptr)
{
    ASSERT_ERR((((uint32_t)ramptype << 28) & ~((uint32_t)0x10000000)) == 0);
    ASSERT_ERR((((uint32_t)rampstep << 24) & ~((uint32_t)0x0F000000)) == 0);
    ASSERT_ERR((((uint32_t)xrfsel << 16) & ~((uint32_t)0x001F0000)) == 0);
    ASSERT_ERR((((uint32_t)spiptr << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL1_ADDR,  ((uint32_t)ramptype << 28) | ((uint32_t)rampstep << 24) | ((uint32_t)xrfsel << 16) | ((uint32_t)spiptr << 0));
}

__INLINE void ble_radiocntl1_unpack(uint8_t* ramptype, uint8_t* rampstep, uint8_t* xrfsel, uint16_t* spiptr)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL1_ADDR);

    *ramptype = (localVal & ((uint32_t)0x10000000)) >> 28;
    *rampstep = (localVal & ((uint32_t)0x0F000000)) >> 24;
    *xrfsel = (localVal & ((uint32_t)0x001F0000)) >> 16;
    *spiptr = (localVal & ((uint32_t)0x0000FFFF)) >> 0;
}

__INLINE uint8_t ble_ramp_type_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x10000000)) >> 28);
}

__INLINE void ble_ramp_type_setf(uint8_t ramptype)
{
    ASSERT_ERR((((uint32_t)ramptype << 28) & ~((uint32_t)0x10000000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL1_ADDR, (REG_BLE_RD(BLE_RADIOCNTL1_ADDR) & ~((uint32_t)0x10000000)) | ((uint32_t)ramptype << 28));
}

__INLINE uint8_t ble_rampstep_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x0F000000)) >> 24);
}

__INLINE void ble_rampstep_setf(uint8_t rampstep)
{
    ASSERT_ERR((((uint32_t)rampstep << 24) & ~((uint32_t)0x0F000000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL1_ADDR, (REG_BLE_RD(BLE_RADIOCNTL1_ADDR) & ~((uint32_t)0x0F000000)) | ((uint32_t)rampstep << 24));
}

__INLINE uint8_t ble_xrfsel_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x001F0000)) >> 16);
}

