yangchengxcy/da14580/src/dialog/include/reg_blecore.h
__INLINE void ble_xrfsel_setf(uint8_t xrfsel)
{
    ASSERT_ERR((((uint32_t)xrfsel << 16) & ~((uint32_t)0x001F0000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL1_ADDR, (REG_BLE_RD(BLE_RADIOCNTL1_ADDR) & ~((uint32_t)0x001F0000)) | ((uint32_t)xrfsel << 16));
}

__INLINE uint16_t ble_spiptr_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x0000FFFF)) >> 0);
}

__INLINE void ble_spiptr_setf(uint16_t spiptr)
{
    ASSERT_ERR((((uint32_t)spiptr << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL1_ADDR, (REG_BLE_RD(BLE_RADIOCNTL1_ADDR) & ~((uint32_t)0x0000FFFF)) | ((uint32_t)spiptr << 0));
}

#if RW_BLE_SUPPORT
/**
 * @brief RADIOCNTL2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  29:24          REGUP_DELAY   0x0
 *  23:18           RXDN_DELAY   0x0
 *  17:12           RXUP_DELAY   0x0
 *  11:06           TXDN_DELAY   0x0
 *  05:00           TXUP_DELAY   0x0
 * </pre>
 */
#define BLE_RADIOCNTL2_ADDR   0x40000078
#define BLE_RADIOCNTL2_OFFSET 0x00000078
#define BLE_RADIOCNTL2_INDEX  0x0000001E
#define BLE_RADIOCNTL2_RESET  0x00000000

__INLINE uint32_t ble_radiocntl2_get(void)
{
    return REG_BLE_RD(BLE_RADIOCNTL2_ADDR);
}

__INLINE void ble_radiocntl2_set(uint32_t value)
{
    REG_BLE_WR(BLE_RADIOCNTL2_ADDR, value);
}

// field definitions
#define BLE_REGUP_DELAY_MASK   ((uint32_t)0x3F000000)
#define BLE_REGUP_DELAY_LSB    24
#define BLE_REGUP_DELAY_WIDTH  ((uint32_t)0x00000006)
#define BLE_RXDN_DELAY_MASK    ((uint32_t)0x00FC0000)
#define BLE_RXDN_DELAY_LSB     18
#define BLE_RXDN_DELAY_WIDTH   ((uint32_t)0x00000006)
#define BLE_RXUP_DELAY_MASK    ((uint32_t)0x0003F000)
#define BLE_RXUP_DELAY_LSB     12
#define BLE_RXUP_DELAY_WIDTH   ((uint32_t)0x00000006)
#define BLE_TXDN_DELAY_MASK    ((uint32_t)0x00000FC0)
#define BLE_TXDN_DELAY_LSB     6
#define BLE_TXDN_DELAY_WIDTH   ((uint32_t)0x00000006)
#define BLE_TXUP_DELAY_MASK    ((uint32_t)0x0000003F)
#define BLE_TXUP_DELAY_LSB     0
#define BLE_TXUP_DELAY_WIDTH   ((uint32_t)0x00000006)

#define BLE_REGUP_DELAY_RST    0x0
#define BLE_RXDN_DELAY_RST     0x0
#define BLE_RXUP_DELAY_RST     0x0
#define BLE_TXDN_DELAY_RST     0x0
#define BLE_TXUP_DELAY_RST     0x0

__INLINE void ble_radiocntl2_pack(uint8_t regupdelay, uint8_t rxdndelay, uint8_t rxupdelay, uint8_t txdndelay, uint8_t txupdelay)
{
    ASSERT_ERR((((uint32_t)regupdelay << 24) & ~((uint32_t)0x3F000000)) == 0);
    ASSERT_ERR((((uint32_t)rxdndelay << 18) & ~((uint32_t)0x00FC0000)) == 0);
    ASSERT_ERR((((uint32_t)rxupdelay << 12) & ~((uint32_t)0x0003F000)) == 0);
    ASSERT_ERR((((uint32_t)txdndelay << 6) & ~((uint32_t)0x00000FC0)) == 0);
    ASSERT_ERR((((uint32_t)txupdelay << 0) & ~((uint32_t)0x0000003F)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL2_ADDR,  ((uint32_t)regupdelay << 24) | ((uint32_t)rxdndelay << 18) | ((uint32_t)rxupdelay << 12) | ((uint32_t)txdndelay << 6) | ((uint32_t)txupdelay << 0));
}

__INLINE void ble_radiocntl2_unpack(uint8_t* regupdelay, uint8_t* rxdndelay, uint8_t* rxupdelay, uint8_t* txdndelay, uint8_t* txupdelay)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL2_ADDR);

    *regupdelay = (localVal & ((uint32_t)0x3F000000)) >> 24;
    *rxdndelay = (localVal & ((uint32_t)0x00FC0000)) >> 18;
    *rxupdelay = (localVal & ((uint32_t)0x0003F000)) >> 12;
    *txdndelay = (localVal & ((uint32_t)0x00000FC0)) >> 6;
    *txupdelay = (localVal & ((uint32_t)0x0000003F)) >> 0;
}

__INLINE uint8_t ble_regup_delay_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x3F000000)) >> 24);
}

__INLINE void ble_regup_delay_setf(uint8_t regupdelay)
{
    ASSERT_ERR((((uint32_t)regupdelay << 24) & ~((uint32_t)0x3F000000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL2_ADDR, (REG_BLE_RD(BLE_RADIOCNTL2_ADDR) & ~((uint32_t)0x3F000000)) | ((uint32_t)regupdelay << 24));
}

__INLINE uint8_t ble_rxdn_delay_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00FC0000)) >> 18);
}

__INLINE void ble_rxdn_delay_setf(uint8_t rxdndelay)
{
    ASSERT_ERR((((uint32_t)rxdndelay << 18) & ~((uint32_t)0x00FC0000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL2_ADDR, (REG_BLE_RD(BLE_RADIOCNTL2_ADDR) & ~((uint32_t)0x00FC0000)) | ((uint32_t)rxdndelay << 18));
}

__INLINE uint8_t ble_rxup_delay_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x0003F000)) >> 12);
}

__INLINE void ble_rxup_delay_setf(uint8_t rxupdelay)
{
    ASSERT_ERR((((uint32_t)rxupdelay << 12) & ~((uint32_t)0x0003F000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL2_ADDR, (REG_BLE_RD(BLE_RADIOCNTL2_ADDR) & ~((uint32_t)0x0003F000)) | ((uint32_t)rxupdelay << 12));
}

__INLINE uint8_t ble_txdn_delay_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00000FC0)) >> 6);
}

__INLINE void ble_txdn_delay_setf(uint8_t txdndelay)
{
    ASSERT_ERR((((uint32_t)txdndelay << 6) & ~((uint32_t)0x00000FC0)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL2_ADDR, (REG_BLE_RD(BLE_RADIOCNTL2_ADDR) & ~((uint32_t)0x00000FC0)) | ((uint32_t)txdndelay << 6));
}

__INLINE uint8_t ble_txup_delay_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x0000003F)) >> 0);
}

__INLINE void ble_txup_delay_setf(uint8_t txupdelay)
{
    ASSERT_ERR((((uint32_t)txupdelay << 0) & ~((uint32_t)0x0000003F)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL2_ADDR, (REG_BLE_RD(BLE_RADIOCNTL2_ADDR) & ~((uint32_t)0x0000003F)) | ((uint32_t)txupdelay << 0));
}

#endif // RW_BLE_SUPPORT
#if RW_BLE_CUST1_INST
/**
 * @brief RADIOCNTL3 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24           PBUS_VALUE   0x0
 *     18           PSTB_VALUE   0
 *  17:16           PSEL_VALUE   0x0
 *     15            RX_ON_POL   0
 *     14            TX_EN_POL   0
 *     13            PA_ON_POL   0
 *     12           REG_ON_POL   0
 *     11          RX_ON_VALUE   0
 *     10          TX_EN_VALUE   0
 *     09          PA_ON_VALUE   0
 *     08         REG_ON_VALUE   0
 *     04           FORCE_PBUS   0
 *     03          FORCE_RX_ON   0
 *     02          FORCE_TX_EN   0
 *     01          FORCE_PA_ON   0
 *     00         FORCE_REG_ON   0
 * </pre>
 */
#define BLE_RADIOCNTL3_ADDR   0x4000007C
#define BLE_RADIOCNTL3_OFFSET 0x0000007C
#define BLE_RADIOCNTL3_INDEX  0x0000001F
#define BLE_RADIOCNTL3_RESET  0x00000000

__INLINE uint32_t ble_radiocntl3_get(void)
{
    return REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
}

__INLINE void ble_radiocntl3_set(uint32_t value)
{
    REG_BLE_WR(BLE_RADIOCNTL3_ADDR, value);
}

