yangchengxcy/da14580/src/dialog/include/reg_blecore.h
// field definitions
#define BLE_PBUS_VALUE_MASK     ((uint32_t)0xFF000000)
#define BLE_PBUS_VALUE_LSB      24
#define BLE_PBUS_VALUE_WIDTH    ((uint32_t)0x00000008)
#define BLE_PSTB_VALUE_BIT      ((uint32_t)0x00040000)
#define BLE_PSTB_VALUE_POS      18
#define BLE_PSEL_VALUE_MASK     ((uint32_t)0x00030000)
#define BLE_PSEL_VALUE_LSB      16
#define BLE_PSEL_VALUE_WIDTH    ((uint32_t)0x00000002)
#define BLE_RX_ON_POL_BIT       ((uint32_t)0x00008000)
#define BLE_RX_ON_POL_POS       15
#define BLE_TX_EN_POL_BIT       ((uint32_t)0x00004000)
#define BLE_TX_EN_POL_POS       14
#define BLE_PA_ON_POL_BIT       ((uint32_t)0x00002000)
#define BLE_PA_ON_POL_POS       13
#define BLE_REG_ON_POL_BIT      ((uint32_t)0x00001000)
#define BLE_REG_ON_POL_POS      12
#define BLE_RX_ON_VALUE_BIT     ((uint32_t)0x00000800)
#define BLE_RX_ON_VALUE_POS     11
#define BLE_TX_EN_VALUE_BIT     ((uint32_t)0x00000400)
#define BLE_TX_EN_VALUE_POS     10
#define BLE_PA_ON_VALUE_BIT     ((uint32_t)0x00000200)
#define BLE_PA_ON_VALUE_POS     9
#define BLE_REG_ON_VALUE_BIT    ((uint32_t)0x00000100)
#define BLE_REG_ON_VALUE_POS    8
#define BLE_FORCE_PBUS_BIT      ((uint32_t)0x00000010)
#define BLE_FORCE_PBUS_POS      4
#define BLE_FORCE_RX_ON_BIT     ((uint32_t)0x00000008)
#define BLE_FORCE_RX_ON_POS     3
#define BLE_FORCE_TX_EN_BIT     ((uint32_t)0x00000004)
#define BLE_FORCE_TX_EN_POS     2
#define BLE_FORCE_PA_ON_BIT     ((uint32_t)0x00000002)
#define BLE_FORCE_PA_ON_POS     1
#define BLE_FORCE_REG_ON_BIT    ((uint32_t)0x00000001)
#define BLE_FORCE_REG_ON_POS    0

#define BLE_PBUS_VALUE_RST      0x0
#define BLE_PSTB_VALUE_RST      0x0
#define BLE_PSEL_VALUE_RST      0x0
#define BLE_RX_ON_POL_RST       0x0
#define BLE_TX_EN_POL_RST       0x0
#define BLE_PA_ON_POL_RST       0x0
#define BLE_REG_ON_POL_RST      0x0
#define BLE_RX_ON_VALUE_RST     0x0
#define BLE_TX_EN_VALUE_RST     0x0
#define BLE_PA_ON_VALUE_RST     0x0
#define BLE_REG_ON_VALUE_RST    0x0
#define BLE_FORCE_PBUS_RST      0x0
#define BLE_FORCE_RX_ON_RST     0x0
#define BLE_FORCE_TX_EN_RST     0x0
#define BLE_FORCE_PA_ON_RST     0x0
#define BLE_FORCE_REG_ON_RST    0x0

__INLINE void ble_radiocntl3_pack(uint8_t pbusvalue, uint8_t pstbvalue, uint8_t pselvalue, uint8_t rxonpol, uint8_t txenpol, uint8_t paonpol, uint8_t regonpol, uint8_t rxonvalue, uint8_t txenvalue, uint8_t paonvalue, uint8_t regonvalue, uint8_t forcepbus, uint8_t forcerxon, uint8_t forcetxen, uint8_t forcepaon, uint8_t forceregon)
{
    ASSERT_ERR((((uint32_t)pbusvalue << 24) & ~((uint32_t)0xFF000000)) == 0);
    ASSERT_ERR((((uint32_t)pstbvalue << 18) & ~((uint32_t)0x00040000)) == 0);
    ASSERT_ERR((((uint32_t)pselvalue << 16) & ~((uint32_t)0x00030000)) == 0);
    ASSERT_ERR((((uint32_t)rxonpol << 15) & ~((uint32_t)0x00008000)) == 0);
    ASSERT_ERR((((uint32_t)txenpol << 14) & ~((uint32_t)0x00004000)) == 0);
    ASSERT_ERR((((uint32_t)paonpol << 13) & ~((uint32_t)0x00002000)) == 0);
    ASSERT_ERR((((uint32_t)regonpol << 12) & ~((uint32_t)0x00001000)) == 0);
    ASSERT_ERR((((uint32_t)rxonvalue << 11) & ~((uint32_t)0x00000800)) == 0);
    ASSERT_ERR((((uint32_t)txenvalue << 10) & ~((uint32_t)0x00000400)) == 0);
    ASSERT_ERR((((uint32_t)paonvalue << 9) & ~((uint32_t)0x00000200)) == 0);
    ASSERT_ERR((((uint32_t)regonvalue << 8) & ~((uint32_t)0x00000100)) == 0);
    ASSERT_ERR((((uint32_t)forcepbus << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)forcerxon << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)forcetxen << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)forcepaon << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)forceregon << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL3_ADDR,  ((uint32_t)pbusvalue << 24) | ((uint32_t)pstbvalue << 18) | ((uint32_t)pselvalue << 16) | ((uint32_t)rxonpol << 15) | ((uint32_t)txenpol << 14) | ((uint32_t)paonpol << 13) | ((uint32_t)regonpol << 12) | ((uint32_t)rxonvalue << 11) | ((uint32_t)txenvalue << 10) | ((uint32_t)paonvalue << 9) | ((uint32_t)regonvalue << 8) | ((uint32_t)forcepbus << 4) | ((uint32_t)forcerxon << 3) | ((uint32_t)forcetxen << 2) | ((uint32_t)forcepaon << 1) | ((uint32_t)forceregon << 0));
}

__INLINE void ble_radiocntl3_unpack(uint8_t* pbusvalue, uint8_t* pstbvalue, uint8_t* pselvalue, uint8_t* rxonpol, uint8_t* txenpol, uint8_t* paonpol, uint8_t* regonpol, uint8_t* rxonvalue, uint8_t* txenvalue, uint8_t* paonvalue, uint8_t* regonvalue, uint8_t* forcepbus, uint8_t* forcerxon, uint8_t* forcetxen, uint8_t* forcepaon, uint8_t* forceregon)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);

    *pbusvalue = (localVal & ((uint32_t)0xFF000000)) >> 24;
    *pstbvalue = (localVal & ((uint32_t)0x00040000)) >> 18;
    *pselvalue = (localVal & ((uint32_t)0x00030000)) >> 16;
    *rxonpol = (localVal & ((uint32_t)0x00008000)) >> 15;
    *txenpol = (localVal & ((uint32_t)0x00004000)) >> 14;
    *paonpol = (localVal & ((uint32_t)0x00002000)) >> 13;
    *regonpol = (localVal & ((uint32_t)0x00001000)) >> 12;
    *rxonvalue = (localVal & ((uint32_t)0x00000800)) >> 11;
    *txenvalue = (localVal & ((uint32_t)0x00000400)) >> 10;
    *paonvalue = (localVal & ((uint32_t)0x00000200)) >> 9;
    *regonvalue = (localVal & ((uint32_t)0x00000100)) >> 8;
    *forcepbus = (localVal & ((uint32_t)0x00000010)) >> 4;
    *forcerxon = (localVal & ((uint32_t)0x00000008)) >> 3;
    *forcetxen = (localVal & ((uint32_t)0x00000004)) >> 2;
    *forcepaon = (localVal & ((uint32_t)0x00000002)) >> 1;
    *forceregon = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t ble_pbus_value_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
    return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

__INLINE void ble_pbus_value_setf(uint8_t pbusvalue)
{
    ASSERT_ERR((((uint32_t)pbusvalue << 24) & ~((uint32_t)0xFF000000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL3_ADDR, (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0xFF000000)) | ((uint32_t)pbusvalue << 24));
}

__INLINE uint8_t ble_pstb_value_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00040000)) >> 18);
}

__INLINE void ble_pstb_value_setf(uint8_t pstbvalue)
{
    ASSERT_ERR((((uint32_t)pstbvalue << 18) & ~((uint32_t)0x00040000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL3_ADDR, (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00040000)) | ((uint32_t)pstbvalue << 18));
}

__INLINE uint8_t ble_psel_value_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00030000)) >> 16);
}

__INLINE void ble_psel_value_setf(uint8_t pselvalue)
{
    ASSERT_ERR((((uint32_t)pselvalue << 16) & ~((uint32_t)0x00030000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL3_ADDR, (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00030000)) | ((uint32_t)pselvalue << 16));
}

