yangchengxcy/da14580/src/dialog/include/reg_blecore.h
__INLINE uint8_t ble_rx_on_pol_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00008000)) >> 15);
}

__INLINE void ble_rx_on_pol_setf(uint8_t rxonpol)
{
    ASSERT_ERR((((uint32_t)rxonpol << 15) & ~((uint32_t)0x00008000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL3_ADDR, (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00008000)) | ((uint32_t)rxonpol << 15));
}

__INLINE uint8_t ble_tx_en_pol_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00004000)) >> 14);
}

__INLINE void ble_tx_en_pol_setf(uint8_t txenpol)
{
    ASSERT_ERR((((uint32_t)txenpol << 14) & ~((uint32_t)0x00004000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL3_ADDR, (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00004000)) | ((uint32_t)txenpol << 14));
}

__INLINE uint8_t ble_pa_on_pol_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00002000)) >> 13);
}

__INLINE void ble_pa_on_pol_setf(uint8_t paonpol)
{
    ASSERT_ERR((((uint32_t)paonpol << 13) & ~((uint32_t)0x00002000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL3_ADDR, (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00002000)) | ((uint32_t)paonpol << 13));
}

__INLINE uint8_t ble_reg_on_pol_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

__INLINE void ble_reg_on_pol_setf(uint8_t regonpol)
{
    ASSERT_ERR((((uint32_t)regonpol << 12) & ~((uint32_t)0x00001000)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL3_ADDR, (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00001000)) | ((uint32_t)regonpol << 12));
}

__INLINE uint8_t ble_rx_on_value_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00000800)) >> 11);
}

__INLINE void ble_rx_on_value_setf(uint8_t rxonvalue)
{
    ASSERT_ERR((((uint32_t)rxonvalue << 11) & ~((uint32_t)0x00000800)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL3_ADDR, (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00000800)) | ((uint32_t)rxonvalue << 11));
}

__INLINE uint8_t ble_tx_en_value_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00000400)) >> 10);
}

__INLINE void ble_tx_en_value_setf(uint8_t txenvalue)
{
    ASSERT_ERR((((uint32_t)txenvalue << 10) & ~((uint32_t)0x00000400)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL3_ADDR, (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00000400)) | ((uint32_t)txenvalue << 10));
}

__INLINE uint8_t ble_pa_on_value_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00000200)) >> 9);
}

__INLINE void ble_pa_on_value_setf(uint8_t paonvalue)
{
    ASSERT_ERR((((uint32_t)paonvalue << 9) & ~((uint32_t)0x00000200)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL3_ADDR, (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00000200)) | ((uint32_t)paonvalue << 9));
}

__INLINE uint8_t ble_reg_on_value_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__INLINE void ble_reg_on_value_setf(uint8_t regonvalue)
{
    ASSERT_ERR((((uint32_t)regonvalue << 8) & ~((uint32_t)0x00000100)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL3_ADDR, (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00000100)) | ((uint32_t)regonvalue << 8));
}

__INLINE uint8_t ble_force_pbus_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE void ble_force_pbus_setf(uint8_t forcepbus)
{
    ASSERT_ERR((((uint32_t)forcepbus << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL3_ADDR, (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)forcepbus << 4));
}

__INLINE uint8_t ble_force_rx_on_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE void ble_force_rx_on_setf(uint8_t forcerxon)
{
    ASSERT_ERR((((uint32_t)forcerxon << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL3_ADDR, (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00000008)) | ((uint32_t)forcerxon << 3));
}

__INLINE uint8_t ble_force_tx_en_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE void ble_force_tx_en_setf(uint8_t forcetxen)
{
    ASSERT_ERR((((uint32_t)forcetxen << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL3_ADDR, (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00000004)) | ((uint32_t)forcetxen << 2));
}

__INLINE uint8_t ble_force_pa_on_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void ble_force_pa_on_setf(uint8_t forcepaon)
{
    ASSERT_ERR((((uint32_t)forcepaon << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL3_ADDR, (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)forcepaon << 1));
}

__INLINE uint8_t ble_force_reg_on_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void ble_force_reg_on_setf(uint8_t forceregon)
{
    ASSERT_ERR((((uint32_t)forceregon << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL3_ADDR, (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)forceregon << 0));
}

#endif // RW_BLE_CUST1_INST
/**
 * @brief RADIOPWRUPDN register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  30:24          RTRIP_DELAY   0x0
 *  23:16              RXPWRUP   0xD2
 *  11:08              TXPWRDN   0x3
 *  07:00              TXPWRUP   0xD2
 * </pre>
 */
#define BLE_RADIOPWRUPDN_ADDR   0x40000080
#define BLE_RADIOPWRUPDN_OFFSET 0x00000080
#define BLE_RADIOPWRUPDN_INDEX  0x00000020
#define BLE_RADIOPWRUPDN_RESET  0x00D203D2

__INLINE uint32_t ble_radiopwrupdn_get(void)
{
    return REG_BLE_RD(BLE_RADIOPWRUPDN_ADDR);
}

__INLINE void ble_radiopwrupdn_set(uint32_t value)
{
    REG_BLE_WR(BLE_RADIOPWRUPDN_ADDR, value);
}

