yangchengxcy/da14580/src/dialog/include/reg_blecore.h
// field definitions
#define BLE_RTRIP_DELAY_MASK   ((uint32_t)0x7F000000)
#define BLE_RTRIP_DELAY_LSB    24
#define BLE_RTRIP_DELAY_WIDTH  ((uint32_t)0x00000007)
#define BLE_RXPWRUP_MASK       ((uint32_t)0x00FF0000)
#define BLE_RXPWRUP_LSB        16
#define BLE_RXPWRUP_WIDTH      ((uint32_t)0x00000008)
#define BLE_TXPWRDN_MASK       ((uint32_t)0x00000F00)
#define BLE_TXPWRDN_LSB        8
#define BLE_TXPWRDN_WIDTH      ((uint32_t)0x00000004)
#define BLE_TXPWRUP_MASK       ((uint32_t)0x000000FF)
#define BLE_TXPWRUP_LSB        0
#define BLE_TXPWRUP_WIDTH      ((uint32_t)0x00000008)

#define BLE_RTRIP_DELAY_RST    0x0
#define BLE_RXPWRUP_RST        0xD2
#define BLE_TXPWRDN_RST        0x3
#define BLE_TXPWRUP_RST        0xD2

__INLINE void ble_radiopwrupdn_pack(uint8_t rtripdelay, uint8_t rxpwrup, uint8_t txpwrdn, uint8_t txpwrup)
{
    ASSERT_ERR((((uint32_t)rtripdelay << 24) & ~((uint32_t)0x7F000000)) == 0);
    ASSERT_ERR((((uint32_t)rxpwrup << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)txpwrdn << 8) & ~((uint32_t)0x00000F00)) == 0);
    ASSERT_ERR((((uint32_t)txpwrup << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_BLE_WR(BLE_RADIOPWRUPDN_ADDR,  ((uint32_t)rtripdelay << 24) | ((uint32_t)rxpwrup << 16) | ((uint32_t)txpwrdn << 8) | ((uint32_t)txpwrup << 0));
}

__INLINE void ble_radiopwrupdn_unpack(uint8_t* rtripdelay, uint8_t* rxpwrup, uint8_t* txpwrdn, uint8_t* txpwrup)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOPWRUPDN_ADDR);

    *rtripdelay = (localVal & ((uint32_t)0x7F000000)) >> 24;
    *rxpwrup = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *txpwrdn = (localVal & ((uint32_t)0x00000F00)) >> 8;
    *txpwrup = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t ble_rtrip_delay_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOPWRUPDN_ADDR);
    return ((localVal & ((uint32_t)0x7F000000)) >> 24);
}

__INLINE void ble_rtrip_delay_setf(uint8_t rtripdelay)
{
    ASSERT_ERR((((uint32_t)rtripdelay << 24) & ~((uint32_t)0x7F000000)) == 0);
    REG_BLE_WR(BLE_RADIOPWRUPDN_ADDR, (REG_BLE_RD(BLE_RADIOPWRUPDN_ADDR) & ~((uint32_t)0x7F000000)) | ((uint32_t)rtripdelay << 24));
}

__INLINE uint8_t ble_rxpwrup_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOPWRUPDN_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

__INLINE void ble_rxpwrup_setf(uint8_t rxpwrup)
{
    ASSERT_ERR((((uint32_t)rxpwrup << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_BLE_WR(BLE_RADIOPWRUPDN_ADDR, (REG_BLE_RD(BLE_RADIOPWRUPDN_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)rxpwrup << 16));
}

__INLINE uint8_t ble_txpwrdn_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOPWRUPDN_ADDR);
    return ((localVal & ((uint32_t)0x00000F00)) >> 8);
}

__INLINE void ble_txpwrdn_setf(uint8_t txpwrdn)
{
    ASSERT_ERR((((uint32_t)txpwrdn << 8) & ~((uint32_t)0x00000F00)) == 0);
    REG_BLE_WR(BLE_RADIOPWRUPDN_ADDR, (REG_BLE_RD(BLE_RADIOPWRUPDN_ADDR) & ~((uint32_t)0x00000F00)) | ((uint32_t)txpwrdn << 8));
}

__INLINE uint8_t ble_txpwrup_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOPWRUPDN_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void ble_txpwrup_setf(uint8_t txpwrup)
{
    ASSERT_ERR((((uint32_t)txpwrup << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_BLE_WR(BLE_RADIOPWRUPDN_ADDR, (REG_BLE_RD(BLE_RADIOPWRUPDN_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)txpwrup << 0));
}

#if RW_BLE_SUPPORT
/**
 * @brief RADIOCNTL4 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  11:00      FORCEAGC_LENGTH   0x0
 * </pre>
 */
#define BLE_RADIOCNTL4_ADDR   0x40000084
#define BLE_RADIOCNTL4_OFFSET 0x00000084
#define BLE_RADIOCNTL4_INDEX  0x00000021
#define BLE_RADIOCNTL4_RESET  0x00000000

__INLINE uint32_t ble_radiocntl4_get(void)
{
    return REG_BLE_RD(BLE_RADIOCNTL4_ADDR);
}

__INLINE void ble_radiocntl4_set(uint32_t value)
{
    REG_BLE_WR(BLE_RADIOCNTL4_ADDR, value);
}

// field definitions
#define BLE_FORCEAGC_LENGTH_MASK   ((uint32_t)0x00000FFF)
#define BLE_FORCEAGC_LENGTH_LSB    0
#define BLE_FORCEAGC_LENGTH_WIDTH  ((uint32_t)0x0000000C)

#define BLE_FORCEAGC_LENGTH_RST    0x0

__INLINE uint16_t ble_forceagc_length_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL4_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x00000FFF)) == 0);
    return (localVal >> 0);
}

__INLINE void ble_forceagc_length_setf(uint16_t forceagclength)
{
    ASSERT_ERR((((uint32_t)forceagclength << 0) & ~((uint32_t)0x00000FFF)) == 0);
    REG_BLE_WR(BLE_RADIOCNTL4_ADDR, (uint32_t)forceagclength << 0);
}

#endif // RW_BLE_SUPPORT
/**
 * @brief ADVCHMAP register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  02:00             ADVCHMAP   0x7
 * </pre>
 */
#define BLE_ADVCHMAP_ADDR   0x40000090
#define BLE_ADVCHMAP_OFFSET 0x00000090
#define BLE_ADVCHMAP_INDEX  0x00000024
#define BLE_ADVCHMAP_RESET  0x00000007

__INLINE uint32_t ble_advchmap_get(void)
{
    return REG_BLE_RD(BLE_ADVCHMAP_ADDR);
}

__INLINE void ble_advchmap_set(uint32_t value)
{
    REG_BLE_WR(BLE_ADVCHMAP_ADDR, value);
}

// field definitions
#define BLE_ADVCHMAP_MASK   ((uint32_t)0x00000007)
#define BLE_ADVCHMAP_LSB    0
#define BLE_ADVCHMAP_WIDTH  ((uint32_t)0x00000003)

#define BLE_ADVCHMAP_RST    0x7

__INLINE uint8_t ble_advchmap_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ADVCHMAP_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x00000007)) == 0);
    return (localVal >> 0);
}

__INLINE void ble_advchmap_setf(uint8_t advchmap)
{
    ASSERT_ERR((((uint32_t)advchmap << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_BLE_WR(BLE_ADVCHMAP_ADDR, (uint32_t)advchmap << 0);
}

/**
 * @brief ADVTIM register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  13:00               ADVINT   0x0
 * </pre>
 */
#define BLE_ADVTIM_ADDR   0x400000A0
#define BLE_ADVTIM_OFFSET 0x000000A0
#define BLE_ADVTIM_INDEX  0x00000028
#define BLE_ADVTIM_RESET  0x00000000

